In [8]:
import numpy  as np
import pandas as pd

In [11]:
data = pd.Series([1,2.4,2,3,4,4,5,5])
data

0    1.0
1    2.4
2    2.0
3    3.0
4    4.0
5    4.0
6    5.0
7    5.0
dtype: float64

In [16]:
x = pd.Series([4,3,2,3],
              index=['a','b','x','d'])
x
x['a']

4

In [25]:
tirakob  = {'mog':133245992,'bosaso':13949382,'laska':989432}
# somalia['mog']
a =pd.Series(tirakob)
baxada = {'mog':493843,'bosaso':38421138,'laska':392647}
b = pd.Series(baxada)

mog         493843
bosaso    38421138
laska       392647
dtype: int64

In [35]:
Dalka = pd.DataFrame({'Tirada_Dadka':tirakob,'Baxada_dhulka':baxada})
Dalka

        Tirada_Dadka  Baxada_dhulka
mog        133245992         493843
bosaso      13949382       38421138
laska         989432         392647

In [33]:
Dalka.columns

Index(['Tirada Dadka', 'Baxada dhulka'], dtype='object')

In [37]:
A = pd.Series([2, 4, 6], index=[0, 1, 2])
B = pd.Series([1, 3, 5], index=[1, 2, 3])
A + B

0    NaN
1    5.0
2    9.0
3    NaN
dtype: float64

In [40]:
B.add(A,fill_value=A.mean())

0    6.0
1    5.0
2    9.0
3    9.0
dtype: float64

In [42]:
import pandas as pd
import numpy as np

class display(object):
    """Display HTML representation of multiple objects"""
    template = """<div style="float: left; padding: 10px;">
    <p style='font-family:"Courier New", Courier, monospace'>{0}</p>{1}
    </div>"""
    def __init__(self, *args):
        self.args = args
        
    def _repr_html_(self):
        return '\n'.join(self.template.format(a, eval(a)._repr_html_())
                         for a in self.args)
    
    def __repr__(self):
        return '\n\n'.join(a + '\n' + repr(eval(a))
                           for a in self.args)

In [43]:
  df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'group': ['Accounting', 'Engineering', 'Engineering', 'HR']})
df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],
                    'hire_date': [2004, 2008, 2012, 2014]})
display('df1', 'df2')

df1
  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

df2
  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014